[
  {
    "date_from": "June 2024",
    "date_to": "Present",
    "title": "Ateneo de Naga University – Project HRIS（Phase 1 and 2）",
    "subtitle": "Contract • Lead Full-Stack Web Developer",
    "screenshots": [],
    "screenshot_note": "These screenshots are publicly available views and do not include the internal system.",
    "tags": ["Oracle", "Laravel 10", "Livewire", "Tailwind", "Internal and Public"],
    "description": "University's Human Resource Information System (HRIS). Designed to manage employee records, HR processes, and centralize HR data to improve efficiency and reduce manual workloads.",
    "description_full": null,
    "video_links": [],
    "proponents": ["Johcel Gene T. Bitara", "Miguel Damien L. Garcera"],
    "contributions": [
      "Lead developer for HRIS: a new web portal for Ateneo de Naga University’s HRMO. Handled confidential access to HR records from the University’s database with careful measures in place.",
      "Developed key modules of the application ranging from reports, management, design, data processing/analysis, and hardware configuration resulting in a drastic improvement to the HR’s workflow in terms of eliminating the manual processes.",
      "Optimized data rendering and fetching of employee records on thousands of records by usage of optimized PL/SQL queries, views, procedures, indexing, functions, server-side implementations, batch processing and client-side rendering.",
      "Crafted and applied a data migration plan to perform a large-scale migration of up to 3M+ records from MySQL and Postgres to Oracle, resulting in unified data records of HRMO in the main database repository of the University.",
      "Wrote clear technical and project documentation, i.e., ERD, user manual, gantt chart, swimlane, data dictionary, and code documentation.",
      "Conducted a comprehensive testing phase, prototyping, and feedback to HRMO, and facilitated onboarding for HR officers to ensure smooth adoption and operational efficiency. Presented the data migration results to HRMO for future decision-making."
    ],
    "features": [
      "Employee Management",
      "Authentication",
      "Attendance Management",
      "Faculty Management",
      "Automated Computation",
      "Leave Management",
      "Work Schedule Management",
      "Contracts and Report Generation",
      "Data Migration",
      "Internal"
    ],
    "source_code_link": "https://mis-git.adnu.edu.ph/misadnu/hris.git",
    "source_code_locked": true,
    "live_demo_link": "https://services.adnu.edu.ph/hris",
    "live_demo_locked": true
  },
  {
    "date_from": "Jan 2024",
    "date_to": "Mar 2024",
    "title": "Ateneo de Naga University – Project RETSU",
    "subtitle": "Contract • Lead Full-Stack Web Developer",
    "screenshots": [
      {
        "original": "retsu/retsu-1.png",
        "thumbnail": "retsu/retsu-1.png"
      },
      {
        "original": "retsu/retsu-1-video.png",
        "thumbnail": "retsu/retsu-1-video.png"
      },
      {
        "original": "retsu/retsu-2.png",
        "thumbnail": "retsu/retsu-2.png"
      },
      {
        "original": "retsu/retsu-3.png",
        "thumbnail": "retsu/retsu-3.png"
      },
      {
        "original": "retsu/retsu-4.png",
        "thumbnail": "retsu/retsu-4.png"
      },
      {
        "original": "retsu/retsu-5.png",
        "thumbnail": "retsu/retsu-5.png"
      },
      {
        "original": "retsu/retsu-6.png",
        "thumbnail": "retsu/retsu-6.png"
      }
    ],
    "screenshot_note": "These screenshots are publicly available views and do not include the internal system.",
    "tags": ["Oracle", "Laravel 9", "Livewire", "Tailwind", "Internal and Public"],
    "description": "A generic real-time queue management system solution for the University, enhancing user experience by reducing queue delays and eliminating the inconveniences associated with traditional queuing systems.",
    "description_full": null,
    "video_links": [],
    "proponents": ["Johcel Gene T. Bitara", "Ryan Jay D. Rosano"],
    "contributions": [
      "Developed a queue management system solution for the University, which enhanced the user experience by reducing queue delays and eliminating the inconveniences associated with traditional queuing systems.",
      "Developed a comprehensive queue management system for the University Treasurer’s Office, integrating a QR code-based ticketing system and a real-time queue status view for clients, with customizable controls through admin management.",
      "Optimized front-end, back-end, and database by improving SQL queries and data handling, increasing system efficiency by 84% and enabling seamless page loads with 26,000+ transactions per branch.",
      "Developed the system within a stringent two-month development and deployment timeframe, followed by a five-month maintenance period, while adhering to strict deadlines and managing time-sensitive pressures.",
      "Conducted a comprehensive testing phase, prototyping, and feedback, and facilitated onboarding for clients to ensure smooth adoption and operational efficiency."
    ],
    "features": [
      "Real-time Monitor View",
      "Queue Management",
      "Kiosk Device",
      "Online Queueing System",
      "Authentication",
      "User Privileges",
      "Internal and Public",
      "Generic",
      "Company Management",
      "Queue Branch Management",
      "Staff/Counter Management",
      "Company Overall Reports, Branch Overall Reports, Staff Performance Report"
    ],
    "source_code_link": "https://mis-git.adnu.edu.ph/jbitara/retsu.git",
    "source_code_locked": true,
    "live_demo_link": "https://services.adnu.edu.ph/queue",
    "live_demo_locked": false
  },
  {
    "date_from": "Sep 2022",
    "date_to": "Oct 2023",
    "title": "Department of Agriculture – Project DAAMIA",
    "subtitle": "Subcontract • Lead Full-Stack Web Developer",
    "screenshots": [],
    "screenshot_note": "These screenshots are publicly available views and do not include the internal system.",
    "tags": ["DOTNET Framework", "C–SHARP", "MSSQL", "Internal"],
    "description": "A real-time weather monitoring system for data analytics to Department of Agriculture stakeholders.",
    "description_full": null,
    "video_links": [],
    "proponents": ["Johcel Gene T. Bitara", "Andrew Coros", "Samson Galicia Nollora Jr."],
    "contributions": [
      "Developed a weather monitoring system by processing and storing large number of datasets from a local API weather data.",
      "Optimized the API fetching process to achieve 80% efficiency, which improved the rendering of pin markers on the map view, reduced the load time of pages, and enhanced data processing for the filter page.",
      "Created a background service built using C# WinForms for fetching and storing 10,000+ records per day of real-time weather data per station into the database.",
      "Implemented SMTP and enforced backend security for handling RESTful API requests, preventing server overload.",
      "Implemented, wrote, and designed a secure API, UI/UX of the application, data processing, and database configuration."
    ],
    "features": ["Real-time", "Weather Monitoring", "Data Extraction", "Map Visualization", "Data Export"],
    "source_code_link": "https://github.com/Government-Projects/amia.git",
    "source_code_locked": true,
    "live_demo_link": null,
    "live_demo_locked": true
  }
]
